      # -*- coding: utf-8 -*-
from testAPI import chat_completion_request, extract_context_score

def main():
    messages = []
    context_score = []
    messages.append({"role": "system", "content" : "당신은 면접 지원자의 답변을 피드백해주는 언어 교정과 문맥 피드백 도우미입니다. 사용자의 요청에서 질문(Q)과 답변(A) 중 하나라도 없다면 질문과 답변을 모두 입력해달라고 반드시 추가 요청합니다. 조건에 따라 사용자에게 피드백합니다."}),
    messages.append({"role": "system", "content" : "입력된 답변(A)에서 빈도수가 가장 높은 상위 5개의 단어와 각각의 횟수를 출력합니다.문맥상 불필요한 표현을 텍스트 길이에 비례해 0 ~ 10개 내의 범위 안에서 출력합니다.문맥에 맞지 않는 표현을 대체할 수 있는 표현을 추천합니다.\n주어진 질문에 대한 답변이 문맥상 올바른지, 그리고 교정해야할 언어 습관이 무엇인지 피드백해줍니다. 예시를 들어 피드백을 더 자세히 설명해 줄 수도 있습니다"}),
    messages.append({"role": "system", "content" : "사용자의 요청은 원래 사용자가 녹음한 음성을 텍스트로 변환한 것입니다. 따라서 피드백 내용 중 텍스트(구두점, 쉼표)에 대한 부분은 절대 피드백하지 않습니다."}),
    messages.append({"role": "system", "content" : "항상 반드시 다음과 같은 형식으로 출력합니다: 단어 빈도수 상위 5개\n\n(출력내용)\n\n문맥상 불필요한 표현\n\n(출력내용)\n\n대체 표현 추천\n\n(출력내용)\n\n피드백\n\n(출력내용), '단어 빈도수 상위 5개에는 각각의 횟수도 포함시키고 단어마다 줄바꿈을 하고 형식은 '단어 : n회'로 합니다. '문맥상 불필요한 표현'에서는 표현마다 줄바꿈을 합니다. '대체 표현 추천'에서는 '불필요한 표현 -> 대체 표현(삭제 시 '삭제' 라고 출력)'의 형식으로 출력하고 표현마다 줄바꿈을 합니다. '피드백'에서는 필요 시 예제를 제공하되 띄어쓰기나 한 줄 건너띄기나 줄바꿈 없이 '예를 들어'라는 서두로 시작하고, '피드백' 내에서는 한 줄 건너띄기를 금지합니다. 전반적으로 내용을 평가할 때도 한줄 건너띄기를 금지합니다"}),
    messages.append({"role": "user", "content" : "Q. 본인의 장단점을 각각 말씀해 주시고 그것을 특화시키고 극복하기 위한 노력도 함께 설명해 주세요.\nA. 저의 장점은 제가 맡은 일을 책임지고 끝까지 해내는 것입니다. 큰 걸림돌이 있어도 그걸 해결하고 마지막까지 최선을 다해 성패와 관계없이 보람을 느낍니다. 단점은 도전하는 것을 좋아하지 않는 것입니다. 완벽주의적 성향으로 인해 도전을 실패할까봐 두려워했습니다. 그러나 외국으로 교환학생을 다녀오면서 도전이라는 것이 결국은 나를 성장하게 해주는 것임을 깨닫고 긍정적으로 바라보려 노력 중입니다."}),

    context_score.append({"role": "system", "content" : "당신은 면접 지원자의 답변을 피드백해주는 언어 교정과 문맥 피드백 도우미입니다. 사용자의 요청에서 질문(Q)과 답변(A) 중 하나라도 없다면 질문과 답변을 모두 입력해달라고 반드시 추가 요청합니다. 조건에 따라 사용자에게 피드백합니다."}),
    context_score.append({"role": "system", "content" : "사용자의 답변에 대한 점수를 매기고, 'nn'과 같은 형식으로 숫자만 출력합니다.(예시로, 15점이면 '15' 이렇게 합니다. 현재 개발자로부터 'context'를 제외한 부분은 제공받지 않았으므로 25점 만점으로만 표현합니다)"})
    context_score.append({"role": "system", "content" : "문맥에 대한 점수를 주는 기준은 각각의 질문에 대해 주어진 모범답안을 기준으로 합니다. 각각의 질문에 대해 주어진 모범답안을 기준으로 한다는 뜻은 답변 내용의 디테일한 부분이 아니라 전체적인 문맥을 보고 이것이 모범답안과 비슷할수록 높게 점수를 매깁니다." })
    context_score.append({"role": "system", "content" : "다음은 각각의 질문과 그에 대한 모범 답안입니다.\
                          (질문1)'본인의 장단점을 각각 말씀해 주시고 그것을 특화시키고 극복하기 위한 노력도 함께 설명해 주세요.', (모범답변1)'저의 장점은 많은 호기심을 갖고 있다는 것입니다. 궁금해 하는 것은 생각에 가두지 않고 직접 경험해 보는 편입니다. 업무에서도 처음 맡은 일을 두려워하지 않고 부딪히고 배워 나가는 것에 큰 보람과 기쁨을 느낍니다. 저의 단점은 하나에 집중을 하면 주변을 잘 못 봅니다. 이로 인해 제가 집중할 때 주변으로부터 들은 정보를 잘 기억하지 못하는 경우가 발생하곤 했습니다. 그래서 저는 메모하는 습관을 만들어 이를 극복했습니다.',\
                          (질문2)'특별히 가고 싶은 회사가 있으신가요? 어떤 점을 중점적으로 보시는지 궁금합니다.', (모범답변2)'저는 조직의 분위기 좋은 곳에서 일하고 싶습니다. 일하는 곳은 밝고 환하고 긍정적이어야 된다고 생각합니다. 사람들은 즐겁고 유쾌한 사람과 함께 있고 싶어합니다. 어두운 사람하고 어울리고 싶어하지 않습니다. 밝고 환한 분위기에서 긍정적인 에너지가 나오고 그런 긍정적인 에너지는 조직의 성과로 이어지기 때문입니다. 구성원들이 재미있게 일할 수 있는 즐거운 환경을 만들어 주어야 한다고 생각합니다.',\
                          (질문3)'사람들과 함께 협업을 하면서 제일 어려웠던 점이 있다면 무엇이었나요? 어떻게 극복하셨나요?', (모범답변3)'사람들과 협업을 하면서 가장 어려웠던 점이 있다면 사람들은 열 명이면 열 명 다 다른 생각과 사고방식을 가지고 있다는 것을 피부로 체험했을 때 굉장히 어려웠습니다. 내가 가진 생각과 다른 이가 가진 생각이 다른데 이를 어떻게 일치시켜 일을 진행할 것인지 고민해야했을 때 어려웠습니다. 하지만 충분한 데이터와 소통을 통해 서로의 의견을 절충하여 하나의 목표를 바라봤을 때 협업이 원활히 이루어진다는 것을 느꼈습니다.',\
                          (질문4)'만약 직무에 맞지 않는 일을 하게 된다면 어떻게 하실건가요?', (모범답변4)'제가 만약 직무에 맞지 않는 일을 맡아야 한다면 저는 우선 제 능력에 대해서 한 번 다시 점검을 해 보겠습니다. 제가 생각하는 직무가 아닌 다른 직무를 맡기신 회사의 의견에 어느 정도 제가 맞는 능력과 역량을 가지고 있는지 한 번 제 자신을 점검하고 필요한 능력이나 정보들을 채워서 그 일을 맡아서 해도 괜찮겠다라는 결론이 나며 최선을 다해서, 긍정적인 마인드로 직무를 감당해 나갈 것입니다. 그러나 제 결론이 내가 이 직무를 하는 것이 결국 회사에 도움이 되지 않는다는 결론을 내게 된다면 저는 그 일을 포기하고 회사에 말씀 드린다거나 직무를 바꿀 수 있는 요청을 드릴 것입니다.',\
                          (질문5)'남을 잘 이끄는 리더형과 잘 따르는 팔로워형 중 어떤 유형에 속한다고 생각하시나요? 그렇게 생각하는 이유는 무엇인가요?', (모범답변5)'저는 조직이나 단체에서 주로 남을 잘 따르는 팔로워형이며 리더의 지시를 잘 따르고 조직의 긍정적인 발전을 위해 노력하는 편입니다. 제 성격은 전체를 이끌어 나가며 누군가를 지시하고 중요한 판단을 내리는 것에 조금 스트레스를 받는 편입니다. 하지만 그저 리더의 지시만 따르는 수동적인 팔로워가 아닌 리더가 올바르고 빠른 의사 결정을 하기 위해서 리더의 성향에 맞게 대처하며 업무 지식을 쌓기 위해서 노력합니다. 또한 같은 구성원들과 원활한 커뮤니케이션을 통해 같은 목표를 향해 나가는 것을 좋아하고 또 잘하고 있습니다.',\
                          (질문6)'소통 능력을 키우기 위해 어떤 일을 할 수 있나요?', (모범답변6)'소통 능력을 키우기 위해서 저만의 방법은 바로 큰 반응과 호응입니다. 사람은 누구나 자기 자신의 이야기에 귀 기울이는 사람들에게 더 친밀함을 느끼고 맘의 문이 열리는 경향이 있습니다. 저는 잘 듣고 크게 호응하고 고개도 위아래로 끄덕이면서 경청하는 것을 아주 잘합니다.',\
                          (질문7)'해외에 파견 근무를 나가게 된다면 어느 나라에서 일을 하고 싶으신가요 그렇게 생각하시는 이유에 대해서도 함께 말씀해 주세요', (모범답변7)'저는 외국에 나가게 된다면 미국에 가서 일하고 싶습니다. 세계 경제의 중심에 있는 미국의 뉴욕에서 일함으로써 전세계 기업의 트렌드라든가 또 산업의 진행 방향이라든가 이런 것들을 알고 발 빠르게 대처하고 싶습니다. 그래서 미국의 뉴욕에 나가서 일을 해보고 싶습니다.'"})
    context_score.append({"role": "user", "content" : "Q. 본인의 장단점을 각각 말씀해 주시고 그것을 특화시키고 극복하기 위한 노력도 함께 설명해 주세요.\nA. 저의 장점은 제가 맡은 일을 책임지고 끝까지 해내는 것입니다. 큰 걸림돌이 있어도 그걸 해결하고 마지막까지 최선을 다해 성패와 관계없이 보람을 느낍니다. 단점은 도전하는 것을 좋아하지 않는 것입니다. 완벽주의적 성향으로 인해 도전을 실패할까봐 두려워했습니다. 그러나 외국으로 교환학생을 다녀오면서 도전이라는 것이 결국은 나를 성장하게 해주는 것임을 깨닫고 긍정적으로 바라보려 노력 중입니다."})

    context_sc = chat_completion_request(context_score)
    context_score_value = extract_context_score(context_sc)
    print(context_score_value)

    chat_response = chat_completion_request(messages)
    if isinstance(chat_response, Exception):
        print(chat_response)
    else:
        print(chat_response.choices[0].message.content)

if __name__ == '__main__':
    main()
